Tekla Open API Reference for Tekla Structures 2025
Operation.IFCExportFlags Structure
 Boolean flags for IFC 4 export.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public struct IFCExportFlags
Public Structure IFCExportFlags
The Operation.IFCExportFlags type exposes the following members.
Properties
Name | Description
UseIfcMapConversion
 Boolean indicating whether to use IfcMapConversion with base points is enabled. By default IFC4 export should use IfcMapConversion. Uninitialized null will be converted to true during export.
Top
Fields
Name | Description
ExportRebarSetGroupAsIndividualBars
 Rebar set group individual bars export is enabled.
IsAssembliesEnabled
 Boolean indicating whether the assemblies export is enabled.
IsBoltsEnabled
 Boolean indicating whether the bolts export is enabled.
IsFlatBeamsAsPlates
 Export flat beams as plates.
IsGridsEnabled
 Boolean indicating whether the grids export is enabled.
IsLocationFromBuildingHierarchy
 Get locations from Building Hierarchy.
IsLocationFromOrganizer
 Get locations from organizer.
IsPoursEnabled
 Pours export is enabled. True for pours, false for CIP cast-units and/or parts
IsRebarsEnabled
 Boolean indicating whether the rebars export is enabled.
IsSpacesEnabled
 Boolean indicating whether the export of spaces in building hierarchy is enabled.
IsSurfaceTreatmentsAndSurfacesEnabled
 Boolean indicating whether the surfaces and surface treatments export is enabled.
IsWeldsEnabled
 Boolean indicating whether the welds export is enabled.
Top
See Also
Reference
Tekla.Structures.Model.Operations Namespace